[
  {
    "id": "winter-festival",
    "title": "Winter Festival of Lights",
    "titleAr": "مهرجان الشتاء للأضواء",
    "summary": "A magical celebration of winter with millions of twinkling lights and festive performances",
    "summaryAr": "احتفال سحري بالشتاء مع ملايين الأضواء المتلألئة والعروض الاحتفالية",
    "description": "Experience the magic of winter at our annual Festival of Lights. The entire destination transforms into a wonderland of illuminated displays, featuring interactive light installations, festive performances, and seasonal treats. Perfect for families and visitors of all ages.",
    "descriptionAr": "عش سحر الشتاء في مهرجان الأضواء السنوي. تتحول الوجهة بأكملها إلى عالم من العروض المضيئة، مع التركيبات الضوئية التفاعلية والعروض الاحتفالية والحلويات الموسمية. مثالي للعائلات والزوار من جميع الأعمار.",
    "category": "festival",
    "startDate": "2025-12-01",
    "endDate": "2025-12-31",
    "time": "6:00 PM - 11:00 PM",
    "location": "Main Plaza & Gardens",
    "image": "https://images.unsplash.com/photo-1543589923-d58f523da226?w=800&h=600&fit=crop",
    "ticketPrice": "Free",
    "tags": ["winter", "lights", "family", "free"],
    "featured": true
  },
  {
    "id": "cultural-exchange",
    "title": "Global Cultural Exchange",
    "titleAr": "التبادل الثقافي العالمي",
    "summary": "Experience cultures from around the world through music, dance, and traditional arts",
    "summaryAr": "عش الثقافات من جميع أنحاء العالم من خلال الموسيقى والرقص والفنون التقليدية",
    "description": "Join us for a month-long celebration of global cultures featuring traditional music performances, dance shows, art exhibitions, and cultural workshops. Visitors can learn about different traditions, taste authentic cuisines, and participate in hands-on activities.",
    "descriptionAr": "انضم إلينا في احتفال لمدة شهر بالثقافات العالمية يضم عروض الموسيقى التقليدية وعروض الرقص والمعارض الفنية وورش العمل الثقافية. يمكن للزوار التعلم عن التقاليد المختلفة وتذوق المأكولات الأصيلة والمشاركة في الأنشطة العملية.",
    "category": "cultural",
    "startDate": "2026-01-15",
    "endDate": "2026-02-15",
    "time": "Various times",
    "location": "Cultural Pavilion & Outdoor Stages",
    "image": "https://images.unsplash.com/photo-1516450360452-9312f5e86fc7?w=800&h=600&fit=crop",
    "ticketPrice": "Free - $25",
    "tags": ["cultural", "music", "dance", "art"],
    "featured": true
  },
  {
    "id": "food-festival",
    "title": "International Food Festival",
    "titleAr": "مهرجان الطعام الدولي",
    "summary": "Savor flavors from around the world with top chefs and authentic cuisines",
    "summaryAr": "تذوق النكهات من جميع أنحاء العالم مع أفضل الطهاة والمأكولات الأصيلة",
    "description": "Embark on a culinary journey around the world at our International Food Festival. Sample authentic dishes from over 30 countries, watch live cooking demonstrations by renowned chefs, and participate in food workshops. From street food to fine dining, there's something for every palate.",
    "descriptionAr": "انطلق في رحلة طهي حول العالم في مهرجان الطعام الدولي. تذوق أطباقاً أصيلة من أكثر من 30 دولة، وشاهد عروض الطهي المباشرة من الطهاة المشهورين، وشارك في ورش العمل الغذائية. من طعام الشارع إلى الطعام الفاخر، هناك شيء لكل ذوق.",
    "category": "food",
    "startDate": "2026-02-20",
    "endDate": "2026-02-28",
    "time": "11:00 AM - 10:00 PM",
    "location": "Food Court & Outdoor Dining Areas",
    "image": "https://images.unsplash.com/photo-1555939594-58d7cb561ad1?w=800&h=600&fit=crop",
    "ticketPrice": "$15 - $45",
    "tags": ["food", "international", "culinary", "tasting"],
    "featured": true
  },
  {
    "id": "spring-garden-show",
    "title": "Spring Garden Show",
    "titleAr": "معرض حدائق الربيع",
    "summary": "Celebrate spring with stunning floral displays and gardening workshops",
    "summaryAr": "احتفل بالربيع مع العروض الزهرية المذهلة وورش عمل البستنة",
    "description": "Welcome spring with our annual Garden Show featuring breathtaking floral arrangements, landscape design exhibits, and interactive gardening workshops. Learn about sustainable gardening practices, discover rare plant species, and take home gardening tips from experts.",
    "descriptionAr": "رحب بالربيع في معرض الحدائق السنوي الذي يضم ترتيبات زهرية مذهلة ومعارض تصميم المناظر الطبيعية وورش عمل البستنة التفاعلية. تعلم عن ممارسات البستنة المستدامة واكتشف أنواع النباتات النادرة وخذ نصائح البستنة إلى المنزل من الخبراء.",
    "category": "nature",
    "startDate": "2026-03-15",
    "endDate": "2026-03-22",
    "time": "9:00 AM - 6:00 PM",
    "location": "Botanical Gardens & Greenhouse",
    "image": "https://images.unsplash.com/photo-1441974231531-c6227db76b6e?w=800&h=600&fit=crop",
    "ticketPrice": "$10 - $20",
    "tags": ["spring", "garden", "nature", "workshops"],
    "featured": false
  },
  {
    "id": "adventure-race",
    "title": "Urban Adventure Race",
    "titleAr": "سباق المغامرات الحضرية",
    "summary": "Challenge yourself in this exciting urban obstacle course race",
    "summaryAr": "تحدى نفسك في هذا السباق المثير للمعوقات الحضرية",
    "description": "Test your limits in our Urban Adventure Race featuring challenging obstacles, puzzle-solving elements, and physical challenges throughout the destination. Teams compete for prizes while exploring hidden corners and discovering new attractions.",
    "descriptionAr": "اختبر حدودك في سباق المغامرات الحضرية الذي يضم معوقات صعبة وعناصر حل الألغاز وتحديات جسدية في جميع أنحاء الوجهة. تتنافس الفرق على الجوائز بينما تستكشف الزوايا المخفية وتكتشف معالم جديدة.",
    "category": "adventure",
    "startDate": "2026-04-10",
    "endDate": "2026-04-10",
    "time": "8:00 AM - 4:00 PM",
    "location": "Throughout Destination",
    "image": "https://images.unsplash.com/photo-1558618666-fcd25c85cd64?w=800&h=600&fit=crop",
    "ticketPrice": "$35 - $75",
    "tags": ["adventure", "race", "obstacles", "team"],
    "featured": false
  }
]
